[
  {
    "name": "Gujrat Robofest 4.O",
    "img": "Achievements/guj_robofest.png",
    "review": "Through relentless effort and commitment, three teams from Evolve have successfully advanced to the list of winners in the Ideation Stage of Gujarat Robofest. Competing with brilliant young minds from across India, their innovative ideas and collaborative spirit have earned them recognition on a national platform. This achievement reflects their ability to think creatively, work together as a team, and stand out in a highly competitive environment."
  },
  {
    "name": "TATA Technologies Innovent",
    "img": "Achievements/tata_inno.jpg",
    "review": "Evolve's talented team members, Mr. Yash Kumar Atlani, Mr. Ayush Jain, and Mr. Aman Sharma, have earned a remarkable achievement by being selected as National Finalists for the Tata Technologies InnoVent, a prestigious national hackathon for engineering students. Competing against some of the brightest minds across the country, their selection as finalists highlights their exceptional problem-solving abilities, technical expertise, and innovative approach, which will undoubtedly shape their future endeavors."
  },
  {
    "name": "ISRO-IROC",
    "img": "Achievements/guj_robofest.png",
    "review": "Evolve's dedicated team has achieved an impressive milestone by clearing the first round of the International Robotics Olympiad Challenge (IROC), conducted by ISRO. Competing against some of the most talented robotics enthusiasts in the country, this achievement highlights their technical expertise, problem-solving abilities, and passion for innovation. IROC is a prestigious national-level competition that challenges engineering students to push the boundaries of robotics and automation, solving real-world problems with cutting-edge technology. Advancing to the second round is a testament to our team's relentless dedication and forward-thinking approach."
  },
  {
    "name": "Triumph 24",
    "img": "https://res.cloudinary.com/deblyam9n/image/upload/v1739532116/triumph_wwinners_certificate_and_trophies_tljmkr.jpg",
    "review": "Evolve's teams representing MANIT Bhopal have secured the top three positions in Quizzard at प्रभोत्सव’24, the flagship quiz competition of Triumph, a prestigious national-level event celebrating knowledge, strategy, and quick thinking. Quizzard brought together some of the sharpest minds, challenging participants with diverse questions spanning science, technology, current affairs, and general knowledge. Competing against strong contenders, our teams demonstrated exceptional teamwork, critical thinking, and composure under pressure to emerge victorious."
  }
]